{
  "title": "ENKA Cosmetics",
  "date": "2025-01-15",
  "excerpt": "Complete redesign and rebuild of a cosmetics store in southern Spain. The project included automated scraping from distributor retail sites, a full migration from WordPress, and a fast rebuild using Next.js, Sanity, and Bootstrap to restore the brand’s digital presence.",
  "images": [
    {
      "src": "../../../assets/enka-showcase.webp",
      "alt": "ENKA Cosmetics Website"
    },
    {
      "src": "../../../assets/enka-style.webp",
      "alt": "ENKA Cosmetics Website"
    }
  ],
  "liveLink": "",
  "repoLink": "",
  "colors": ["#f5f5f5", "#cc3366"],
  "techStack": [
    {
      "title": "Next.js",
      "info": "Next.js is a React framework that enables modern web applications with static and dynamic rendering optimized for performance and SEO.",
      "link": "https://nextjs.org/"
    },
    {
      "title": "Sanity",
      "info": "Sanity is a headless content management platform ideal for building flexible and scalable experiences. In this project, it was used as the structured product database.",
      "link": "https://www.sanity.io/"
    },
    {
      "title": "Shibrio",
      "info": "Shibrio is an automated scraping tool that efficiently extracts structured data from third-party websites.",
      "link": "https://shibrio.com/"
    },
    {
      "title": "Bootstrap",
      "info": "Bootstrap is a CSS framework that allows rapid development of responsive web interfaces, perfect for quick and consistent layout.",
      "link": "https://getbootstrap.com/"
    },
    {
      "title": "CSS",
      "info": "CSS was used to customize components and adapt the design precisely and consistently to the brand’s aesthetics.",
      "link": "https://developer.mozilla.org/en-US/docs/Web/CSS"
    }
  ],
  "testimonial": {
    "name": "Client Name",
    "quote": "Thanks to this collaboration, ENKA was able to come back strong online. The team saved our brand!",
    "role": "CEO of ENKA Cosmetics"
  },
  "challenge": "The brand had completely lost its website and database due to previous mismanagement. Without access to their old content or catalog, they needed a fast, secure, and scalable solution to return to the digital market without sacrificing functionality or performance.",
  "solution": "An automated scraping system with Shibrio was designed to rebuild the catalog from retailers. A brand new website was built with Next.js and Sanity as CMS, using Bootstrap to speed up layout. The platform is now fast, secure, and ready to scale with new features."
}
