{
  "title": "Explorer Photo Tours",
  "date": "2025-05-20",
  "excerpt": "Una plataforma ligera y rápida para comprar tours personalizados para fotógrafos en 10 países tropicales y subtropicales, construida con Astro y Preact para maximizar el rendimiento y SEO, con un diseño moderno y conceptos de CRO.",
  "images": [
    {
      "src": "src/assets/projects/explorer-photo-tours-1.webp",
      "alt": "Explorer Photo Tours Website"
    },
    {
      "src": "src/assets/projects/explorer-photo-tours-2.webp",
      "alt": "Explorer Photo Tours Website"
    }
  ],
  "liveLink": "https://explorersphototours.com",
  "repoLink": "https://github.com/N4N1T0/explorer-photo-tours",
  "colors": [],
  "techStack": [
    {
      "title": "Astro",
      "info": "Un moderno generador de sitios estáticos que permite crear webs ultra rápidas al enviar menos JavaScript.",
      "link": "https://astro.build/"
    },
    {
      "title": "Preact",
      "info": "Una alternativa ligera a React, que ofrece las mismas capacidades modernas de UI con un tamaño de paquete mucho menor.",
      "link": "https://preactjs.com/"
    },
    {
      "title": "Anime.js",
      "info": "Una biblioteca flexible de animación en JavaScript usada para crear animaciones suaves y atractivas en la interfaz de usuario.",
      "link": "https://animejs.com/"
    },
    {
      "title": "Vercel",
      "info": "Una plataforma en la nube para sitios estáticos y funciones serverless, optimizada para desarrolladores frontend.",
      "link": "https://vercel.com/"
    }
  ],
  "testimonial": {
    "name": "",
    "quote": "",
    "role": ""
  },
  "challenge": "Crear una plataforma rápida, amigable para SEO y ligera para tours personalizados de fotografía en diversas ubicaciones, con un diseño moderno que fomente la interacción y la conversión de usuarios.",
  "solution": "Construida con Astro para generación estática y optimización del rendimiento, Preact para minimizar el tamaño del paquete y Anime.js para animaciones suaves. Hospedada en Vercel para garantizar escalabilidad y entrega rápida a nivel global. La plataforma se enfoca en principios de CRO y diseño UI moderno para maximizar conversiones.",
  "comingSoon": true
}
