{
  "title": "Yogi",
  "date": "2025-04-10",
  "excerpt": "SaaS innovador para estudiantes y profesores de yoga que facilita la creación de eventos, clases y perfiles personalizados, con funcionalidades de pago y suscripciones para análisis y mejora continua.",
  "images": [],
  "liveLink": "",
  "repoLink": "",
  "colors": [],
  "techStack": [
    {
      "title": "React",
      "info": "Framework de JavaScript para construir interfaces de usuario interactivas y dinámicas en el frontend.",
      "link": "https://reactjs.org/"
    },
    {
      "title": "Bit",
      "info": "Herramienta para compartir y reutilizar componentes de UI entre proyectos y equipos, facilitando el desarrollo colaborativo.",
      "link": "https://bit.dev/"
    },
    {
      "title": "Node.js & Express",
      "info": "Servidor backend y framework para construir APIs robustas y escalables con JavaScript.",
      "link": "https://nodejs.org/, https://expressjs.com/"
    },
    {
      "title": "Passport",
      "info": "Middleware para autenticación en Node.js, facilitando la seguridad y gestión de sesiones.",
      "link": "http://www.passportjs.org/"
    },
    {
      "title": "ChatGM",
      "info": "UI toolkit para construir interfaces conversacionales e interactivas, optimizando la experiencia del usuario.",
      "link": ""
    },
    {
      "title": "Tailwind CSS",
      "info": "Framework CSS para estilos utilitarios que permite construir rápidamente interfaces limpias y responsivas.",
      "link": "https://tailwindcss.com/"
    },
    {
      "title": "Tankstack",
      "info": "Solución para gestión y optimización de llamadas API y comunicación entre servicios.",
      "link": ""
    }
  ],
  "testimonial": {
    "name": "",
    "quote": "",
    "role": ""
  },
  "challenge": "Crear una plataforma SaaS moderna para estudiantes y profesores de yoga que permita gestionar eventos, clases, perfiles y pagos, con funcionalidades avanzadas de filtrado y suscripciones para análisis de desempeño, manteniendo una arquitectura segura y escalable.",
  "solution": "Utilizamos React con Bit para construir una interfaz modular y reutilizable, junto con Node.js y Express en el backend para una API robusta. Implementamos Passport para autenticación segura, Tailwind CSS para un diseño limpio y responsive, y ChatGM para mejorar la experiencia UI. También integramos Tankstack para optimizar las llamadas API, garantizando rendimiento y escalabilidad."
}
