{
  "title": "ENKA Cosmetics",
  "date": "2025-01-15",
  "excerpt": "Rediseño y reconstrucción completa de una tienda de cosmética en el sur de España. El proyecto incluyó scrapping automatizado desde tiendas distribuidoras, una migración completa desde WordPress, y una reconstrucción rápida con Next.js, Sanity y Bootstrap para recuperar la presencia digital de la marca.",
  "images": [
    {
      "src": "src/assets/projects/enka-1.webp",
      "alt": "ENKA Cosmetics Website"
    },
    {
      "src": "src/assets/projects/enka-2.webp",
      "alt": "ENKA Cosmetics Website"
    }
  ],
  "liveLink": "https://enkaesteticapro.com/",
  "repoLink": "https://github.com/N4N1T0/enka-ecommerce",
  "colors": ["#f5f5f5", "#cc3366"],
  "techStack": [
    {
      "title": "Next.js",
      "info": "Next.js es un framework de React que permite desarrollar aplicaciones web modernas con renderizado estático y dinámico, optimizadas para rendimiento y SEO.",
      "link": "https://nextjs.org/"
    },
    {
      "title": "Sanity",
      "info": "Sanity es una plataforma de gestión de contenido headless, ideal para crear experiencias flexibles y escalables. En este proyecto se usó como base de datos estructurada para productos.",
      "link": "https://www.sanity.io/"
    },
    {
      "title": "Cheerio",
      "info": "Cheerio es una herramienta de scraping automatizado que permite extraer datos desde sitios web de terceros de manera eficiente y estructurada.",
      "link": "https://cheerio.js.org "
    },
    {
      "title": "Bootstrap",
      "info": "Bootstrap es un framework CSS que permite desarrollar interfaces web responsivas rápidamente, ideal para maquetación urgente y consistente.",
      "link": "https://getbootstrap.com/"
    }
  ],
  "testimonial": {
    "name": "Jorge Montenegro",
    "quote": "Gracias a esta colaboración, ENKA pudo volver al mercado online con fuerza. ¡El equipo salvó nuestra marca!",
    "role": "CEO de ENKA Cosmetics"
  },
  "challenge": "La marca había perdido completamente su sitio web y base de datos debido a una mala gestión anterior. Sin acceso a su antiguo contenido ni catálogo, necesitaban una solución rápida, segura y escalable para volver al mercado digital sin comprometer funcionalidad o rendimiento.",
  "solution": "Se diseñó un sistema automatizado de scrapping con Shibrio para reconstruir el catálogo desde los retailers. Se creó una web completamente nueva con Next.js y Sanity como CMS, utilizando Bootstrap para acelerar la maquetación. La plataforma ahora es rápida, segura y lista para escalar con nuevas funcionalidades.",
  "comingSoon": false
}
