{
  "title": "Explorer Photo Tours",
  "date": "2025-05-20",
  "excerpt": "A lightweight and fast platform to purchase personalized photography tours across 10 tropical and subtropical countries, built with Astro and Preact to maximize performance and SEO, featuring modern design and CRO concepts.",
  "images": [
    {
      "src": "src/assets/projects/explorer-photo-tours-1.webp",
      "alt": "Explorer Photo Tours Website"
    },
    {
      "src": "src/assets/projects/explorer-photo-tours-2.webp",
      "alt": "Explorer Photo Tours Website"
    }
  ],
  "liveLink": "https://explorersphototours.com",
  "repoLink": "https://github.com/N4N1T0/explorer-photo-tours",
  "colors": [],
  "techStack": [
    {
      "title": "Astro",
      "info": "A modern static site builder that enables ultra-fast websites by shipping less JavaScript.",
      "link": "https://astro.build/"
    },
    {
      "title": "Preact",
      "info": "A lightweight alternative to React, providing the same modern UI capabilities with a much smaller bundle size.",
      "link": "https://preactjs.com/"
    },
    {
      "title": "Anime.js",
      "info": "A flexible JavaScript animation library used to create smooth and engaging UI animations.",
      "link": "https://animejs.com/"
    },
    {
      "title": "Vercel",
      "info": "A cloud platform for static sites and Serverless Functions, optimized for frontend developers.",
      "link": "https://vercel.com/"
    }
  ],
  "testimonial": {
    "name": "",
    "quote": "",
    "role": ""
  },
  "challenge": "Create a fast, SEO-friendly, and lightweight platform for personalized photography tours across diverse locations, with a modern design that encourages user engagement and conversion.",
  "solution": "Built with Astro for static site generation and performance optimization, Preact to minimize bundle size, and Anime.js for smooth animations. Hosted on Vercel to ensure scalability and fast global delivery, the platform focuses on CRO principles and modern UI design to maximize conversions.",
  "comingSoon": true
}
